## Pandas Assignment

In [19]:
import numpy as  np
import pandas as pd

### Create a data series with marks of students : 75, 80, 79, 60

In [4]:
ser=pd.Series([75,80,79,60],index=['abdullah','ayub','asad','rehman'],name='marks of student')
ser

abdullah    75
ayub        80
asad        79
rehman      60
Name: marks of student, dtype: int64

### Create a data frame with name of students, id and marks

In [5]:
dic={'name':['abdullah','ayub','asad','rehman'],'marks':[75,80,79,60],'id':[1,2,3,4]}
data=pd.DataFrame(dic)
display(data)

       name  marks  id
0  abdullah     75   1
1      ayub     80   2
2      asad     79   3
3    rehman     60   4

### Read the CSV file

In [10]:
data=pd.read_csv('test.csv')
data

    Student Department  Age Message
0  Abdullah        BSE   26   Hello
1      Asad         EE   29      Hi
2    Rehman         SE   30     Hru
3      Ayub        ACC   27      Ok

In [11]:
data.columns

Index(['Student', 'Department', 'Age', 'Message'], dtype='object')

### Sort the data based on Marks obtained. Fill all the 'na' cells with 0

In [12]:
dic={'name':['abdullah','ayub','asad','rehman'],'marks':[75,80,79,60],'id':[1,2,3,4]}
data=pd.DataFrame(dic)
display(data.sort_values(by='marks'))
data_n=['name','marks','id','age']
#dic=['texas','utah','california','ohio']
#print(columns=data,fill_values=0)
data=data.reindex(columns=data_n,fill_value=0)
display(data)

       name  marks  id
3    rehman     60   4
0  abdullah     75   1
2      asad     79   3
1      ayub     80   2

       name  marks  id  age
0  abdullah     75   1    0
1      ayub     80   2    0
2      asad     79   3    0
3    rehman     60   4    0

### Display the top 5 rows

In [14]:
states=pd.DataFrame(np.arange(200).reshape((20,10)),columns=['ohio','texas','california','oho','txas','calfornia','ohi','texs','califonia','hio'])
states.head(5)

   ohio  texas  california  oho  txas  calfornia  ohi  texs  califonia  hio
0     0      1           2    3     4          5    6     7          8    9
1    10     11          12   13    14         15   16    17         18   19
2    20     21          22   23    24         25   26    27         28   29
3    30     31          32   33    34         35   36    37         38   39
4    40     41          42   43    44         45   46    47         48   49

### Display the last 5 rows

In [15]:
states.tail(5)

    ohio  texas  california  oho  txas  calfornia  ohi  texs  califonia  hio
15   150    151         152  153   154        155  156   157        158  159
16   160    161         162  163   164        165  166   167        168  169
17   170    171         172  173   174        175  176   177        178  179
18   180    181         182  183   184        185  186   187        188  189
19   190    191         192  193   194        195  196   197        198  199

### Display only those students who got failed in examination

In [21]:
dic={'name':['abdullah','ayub','asad','rehman','hassan', 'raza'],'marks':[75,80,79,60,20,22],'id':[1,2,3,4,5,6]}
data=pd.DataFrame(dic)

display(data[data.marks<40])

     name  marks  id
4  hassan     20   5
5    raza     22   6

### Findout basic statistical info from the data

In [24]:
data.describe()

           marks        id
count   6.000000  6.000000
mean   56.000000  3.500000
std    28.049955  1.870829
min    20.000000  1.000000
25%    31.500000  2.250000
50%    67.500000  3.500000
75%    78.000000  4.750000
max    80.000000  6.000000

### How many students got A, B, C, F?

In [25]:
dic={'name':['abdullah','ayub','asad','rehman','hassan', 'raza'],'marks':[80,80,79,60,20,22],'id':[1,2,3,4,5,6]}
data=pd.DataFrame(dic)
#a=(data[data.marks>40])
count={}
#display(len(a))
for a in data.marks:
    a=int(a)
    if a >= 80 and  a <= 90 :
        s='A'
        count[s]=count.get(s,0)+1
    elif a >= 70 and  a <= 79 :
        s='B'
        count[s]=count.get(s,0)+1
    elif a >= 60 and  a <= 69 :
        s='C'
        count[s]=count.get(s,0)+1
    else:
        s='F'
        count[s]=count.get(s,0)+1
            
print(count)

{'A': 2, 'B': 1, 'C': 1, 'F': 2}

### What are the mean scores for students who got A, B, C, F?

In [26]:
dic={'name':['abdullah','ayub','asad','rehman','hassan', 'raza'],'marks':[80,80,79,60,20,22],'id':[1,2,3,4,5,6]}
data=pd.DataFrame(dic)
a=(data[data.marks>40])
count={}
#display(len(a))
for a in data.marks:
    a=int(a)
    if a >= 80 and  a <= 90 :
        s='A'
        count[s]=count.get(s,0)+1
    elif a >= 70 and  a <= 79 :
        s='B'
        count[s]=count.get(s,0)+1
    elif a >= 60 and  a <= 69 :
        s='C'
        count[s]=count.get(s,0)+1
    else:
        s='F'
        count[s]=count.get(s,0)+1           
print(count)
sum=0
c=0
for i,h in count.items():
    h=int(h)
    sum=sum+h
    c+=1
print("Mean",sum/c)

{'A': 2, 'B': 1, 'C': 1, 'F': 2}
Mean 1.5